import { IPoint, ISchemeElement } from '../types/scheme';

export const SCHEME_ELEMENTS: ISchemeElement[] = [
	{
		title: 'Какое-то название',
		icon: 'yb08',
		id: 'c.3.2.3.2.1.1',
	},
	{
		title: 'Какое-то название',
		icon: 'yb08',
		id: 'c.3.1.3.2.1.1',
		buttons: [
			{
				id: 'btn4',
				text: 'ОК',
			},
			{
				id: 'btn5',
				text: 'дополнительная кнопка',
			},
		],
	},
	{
		title: 'Какое-то название',
		icon: 'xb10',
		id: 'c.3.2.3.1',
	},
	{
		title: 'Какое-то название',
		icon: 'xb10',
		id: 'c.3.1.3.1',
	},
	{
		title: 'Какое-то название',
		icon: 'cabinet',
		id: 'c.3.2.3.2.3',
		buttons: [
			{
				id: 'btn6',
				text: 'ОК',
			},
			{
				id: 'btn7',
				text: 'дополнительная кнопка',
			},
		],
	},
	{
		title: 'Какое-то название',
		icon: 'cabinet',
		id: 'c.3.1.3.2.3',
	},
	{
		title: 'Какое-то название',
		icon: 'lamp',
		id: 'c.3.1.3.3',
		buttons: [
			{
				id: 'btn6',
				text: 'lamp',
			},
		],
	},
	{
		title: 'Какое-то название',
		icon: 'lamp',
		id: 'c.3.2.3.3',
	},
	{
		title: 'Какое-то название',
		icon: 'engine',
		id: 'p.5',
	},
	{
		title: 'Какое-то название',
		icon: 'f01',
		id: 'c.1',
	},
	{
		title: 'Какое-то название',
		icon: 'n322',
		id: 'c.3.1.3.2.2',
	},
	{
		title: 'Какое-то название',
		icon: 'n322',
		id: 'c.3.2.3.2.2',
	},
	{
		title: 'Какое-то название',
		icon: 'p31',
		id: 'p.3.1',
	},
	{
		title: 'Какое-то название',
		icon: 'q01',
		id: 'p.1',
	},
	{
		title: 'Какое-то название',
		icon: 's01',
		id: 'c.3.1.3.2.1.2',
	},
	{
		title: 'Какое-то название',
		icon: 's01',
		id: 'c.3.2.3.2.1.2',
	},
	{
		title: 'Какое-то название',
		icon: 'sq3',
		id: 'c.3.2.1',
	},
	{
		title: 'Какое-то название',
		icon: 'sq3',
		id: 'c.3.1.1',
	},
];

export const SCHEME_POINTS: Record<string, IPoint> = {
	'p.p.0.1': { x: 68, y: -10 },
	'p.p.0.2': { x: 110, y: 7 },
	'p.p.0.3': { x: 152, y: 21 },
	'p.p.2.1': { x: 68, y: 171 },
	'p.p.2.2': { x: 110, y: 171 },
	'p.p.2.3': { x: 152, y: 171 },
	'p.c.0': { x: 68, y: 195 },
	'p.c.1': { x: 300, y: 195 },
	'p.c.2': { x: 352, y: 195 },
	'p.p.3.1': { x: 68, y: 310 },
	'p.p.3.2': { x: 110, y: 280 },
	'p.p.3.3': { x: 152, y: 247 },
	'p.p.4.1': { x: 152, y: 247 },
	'p.p.4.2': { x: 110, y: 415 },
	'p.p.4.3': { x: 152, y: 385 },
	'p.p.5.1': { x: 68, y: 560 },
	'p.p.5.2': { x: 110, y: 560 },
	'p.p.5.3': { x: 152, y: 560 },
	'p.c.3.2.1': { x: 573, y: 195 },
	'p.c.3.2.2': { x: 573, y: 458 },
	'p.c.3.2.3.2.1': { x: 775, y: 195 },
	'p.c.3.2.3.2.2': { x: 746, y: 458 },
	'p.c.n': { x: 930, y: 195 },
};
