import { IPoint, ISchemeElement, InitialState } from '../types/scheme';

export const SCHEME_ELEMENTS: ISchemeElement[] = [
	{
		title: 'Какое-то название',
		icon: 'yb08',
		id: 'c.3.2.3.2.1.1',
	},
	{
		title: 'Какое-то название',
		icon: 'yb08',
		id: 'c.3.1.3.2.1.1',
		buttons: [
			{
				id: 'btn4',
				text: 'ОК',
			},
			{
				id: 'btn5',
				text: 'дополнительная кнопка',
			},
		],
	},
	{
		title: 'Какое-то название',
		icon: 'xb10',
		id: 'c.3.2.3.1',
	},
	{
		title: 'Какое-то название',
		icon: 'xb10',
		id: 'c.3.1.3.1',
	},
	{
		title: 'Какое-то название',
		icon: 'cabinet',
		id: 'c.3.2.3.2.3',
		buttons: [
			{
				id: 'btn6',
				text: 'ОК',
			},
			{
				id: 'btn7',
				text: 'дополнительная кнопка',
			},
		],
	},
	{
		title: 'Какое-то название',
		icon: 'cabinet',
		id: 'c.3.1.3.2.3',
	},
	{
		title: 'Какое-то название',
		icon: 'lamp',
		id: 'c.3.1.3.3',
		buttons: [
			{
				id: 'btn6',
				text: 'lamp',
			},
		],
	},
	{
		title: 'Какое-то название',
		icon: 'lamp',
		id: 'c.3.2.3.3',
	},
	{
		title: 'Какое-то название',
		icon: 'engine',
		id: 'p.5',
	},
	{
		title: 'Какое-то название',
		icon: 'f01',
		id: 'c.1',
	},
	{
		title: 'Какое-то название',
		icon: 'n322',
		id: 'c.3.1.3.2.2',
	},
	{
		title: 'Какое-то название',
		icon: 'n322',
		id: 'c.3.2.3.2.2',
	},
	{
		title: 'Какое-то название',
		icon: 'p31',
		id: 'p.3.1',
	},
	{
		title: 'Какое-то название',
		icon: 'q01',
		id: 'p.1',
	},
	{
		title: 'Какое-то название',
		icon: 's01',
		id: 'c.3.1.3.2.1.2',
	},
	{
		title: 'Какое-то название',
		icon: 's01',
		id: 'c.3.2.3.2.1.2',
	},
	{
		title: 'Какое-то название',
		icon: 'sq3',
		id: 'c.3.2.1',
	},
	{
		title: 'Какое-то название',
		icon: 'sq3',
		id: 'c.3.1.1',
	},
];

export const SCHEME_POINTS: Record<string, IPoint> = {
	'p.p.0.1': { x: 67, y: -6 },
	'p.p.0.2': { x: 109, y: 8 },
	'p.p.0.3': { x: 151, y: 22 },
	'p.p.2.1': { x: 67, y: 167 },
	'p.p.2.2': { x: 110, y: 167 },
	'p.p.2.3': { x: 150, y: 167 },
	'p.c.0': { x: 68, y: 195 },
	'p.c.1': { x: 300, y: 195 },
	'p.c.2': { x: 352, y: 195 },
	'p.p.3.1': { x: 67, y: 307 },
	'p.p.3.2': { x: 109, y: 276 },
	'p.p.3.3': { x: 151, y: 244 },
	'p.p.4.1': { x: 67, y: 449 },
	'p.p.4.2': { x: 109, y: 415 },
	'p.p.4.3': { x: 151, y: 384 },
	'p.p.5.1': { x: 67, y: 559 },
	'p.p.5.2': { x: 109, y: 559 },
	'p.p.5.3': { x: 151, y: 559 },
	'p.c.3.2.1': { x: 574, y: 195 },
	'p.c.3.2.2': { x: 574, y: 459 },
	'p.c.3.2.3.2.1': { x: 756, y: 195 },
	'p.c.3.2.3.2.2': { x: 745, y: 459 },
	'p.c.n': { x: 927, y: 195 },
	'p.c.x': { x: 927, y: 127 }, // переименовать
};

//пока не используются
export const measuringPoints = {
	powerPoints: [
		{
			id: 'p.p.0.1',
			name: 'Фаза А до вводного автомата',
		},
		{
			id: 'p.p.0.2',
			name: 'Фаза B до вводного автомата',
		},
		{
			id: 'p.p.0.3',
			name: 'Фаза C до вводного автомата',
		},
		{
			id: 'p.p.1.1',
			name: 'Фаза А перед автоматом',
		},
		{
			id: 'p.p.1.2',
			name: 'Фаза В перед Ввтоматом',
		},
		{
			id: 'p.p.1.3',
			name: 'Фаза С перед автоматом',
		},
		{
			id: 'p.p.2.1',
			name: 'Фаза A от автомата до пускателей',
		},
		{
			id: 'p.p.2.2',
			name: 'Фаза В от автомата до пускателей',
		},
		{
			id: 'p.p.2.3',
			name: 'Фаза С от автомата до пускателей',
		},
		{
			id: 'p.p.3.1.1',
			name: 'Приходящая на пускатель открыто фаза A',
		},
		{
			id: 'p.p.3.1.2',
			name: 'Приходящая на пускатель открыто фаза В',
		},
		{
			id: 'p.p.3.1.3',
			name: 'Приходящая на пускатель открыто фаза С',
		},
		{
			id: 'p.p.3.2.1',
			name: 'Приходящая на пускатель закрыто фаза А',
		},
		{
			id: 'p.p.3.2.2',
			name: 'Приходящая на пускатель закрыто фаза B',
		},
		{
			id: 'p.p.3.2.3',
			name: 'Приходящая на пускатель закрыто фаза С',
		},
		{
			id: 'p.p.4.1.1',
			name: 'Уходящая от пускателя открыто фаза A',
		},
		{
			id: 'p.p.4.1.2',
			name: 'Уходящая от пускателя открыто фаза В',
		},
		{
			id: 'p.p.4.1.3',
			name: 'Уходящая от пускателя открыто фаза С',
		},
		{
			id: 'p.p.4.2.1',
			name: 'Уходящая от пускателя закрыто фаза A',
		},
		{
			id: 'p.p.4.2.2',
			name: 'Уходящая от пускателя закрыто фаза В',
		},
		{
			id: 'p.p.4.2.3',
			name: 'Уходящая от пускателя закрыто фаза С',
		},
		{
			id: 'p.p.5.1',
			name: 'Начало обмотки Фазы А',
		},
		{
			id: 'p.p.5.2',
			name: 'Начало обмотки Фазы В',
		},
		{
			id: 'p.p.5.3',
			name: 'Начало обмотки Фазы С',
		},
		{
			id: 'p.p.n',
			name: 'Нейтраль',
		},
	],
	circuitPoints: [
		{
			id: 'p.c.0',
			name: 'Фаза A от автомата в цепи контроля',
		},
		{
			id: 'p.c.1',
			name: 'Фаза на выходе автомата',
		},
		{
			id: 'p.c.2',
			name: 'Фаза питающая ветки управления',
		},
		{
			id: 'p.c.3.1.1',
			name: 'Выход фазы с концевого выключателя открыто',
		},
		{
			id: 'p.c.3.1.2',
			name: 'Клемник КРУЗА-П',
		},
		{
			id: 'p.c.3.1.3.2.1',
			name: 'Клемник КРУЗА-П',
		},
		{
			id: 'p.с.3.1.3.2.2',
			name: 'Управляющая фаза команды открыт',
		},
		{
			id: 'p.c.3.2.1',
			name: 'Выход фазы с концевого выключателя закрыто',
		},
		{
			id: 'p.c.3.2.2',
			name: 'Клемник КРУЗА-П',
		},
		{
			id: 'p.c.3.2.3.2.1',
			name: 'Клемник КРУЗА-П',
		},
		{
			id: 'p.с.3.2.3.2.2',
			name: 'Управляющая фаза команды закрыт',
		},
		{
			id: 'p.c.n',
			name: 'Нейтраль',
		},
	],
};

const powerCircuit = [
	[
		{
			id: 'p.1.1',
			name: 'Провод от фазы А до автомата',
			resistance: 0.1,

			malfunctions: [
				{
					id: 'p.1.1.1',
					name: 'Короткое замыкание с фазой C',
					active: false,
				},
				{
					id: 'p.1.1.2',
					name: 'Короткое замыкание с фазой B',
					active: false,
				},
				{
					id: 'p.1.1.3',
					name: 'Обрыв',
					active: false,
				},
				{
					id: 'p.1.1.4',
					name: 'Короткое замыкание на землю',
					active: false,
				},
				{
					id: 'p.1.1.5',
					name: 'Обрыв провода',
					active: false,
				},
			],
		},
		{
			id: 'p.2.1',
			name: 'Сухой контакт фазы А автомата',
			resistance: 0,

			malfunctions: [
				{
					id: 'p.2.1',
					name: 'Плохой контакт на клемме, нет одной фазы',
					active: false,
				},
				{
					id: 'p.2.2',
					name: 'Ложно выбивает',
					active: false,
				},
				{
					id: 'p.2.3',
					name: 'Собирается механически, но нет коммутации',
					active: false,
				},
			],
		},
		{
			id: 'p.3.1',
			name: 'Провод фазы A от автомата до пускателей',
			resistance: 0.1,

			malfunctions: [
				{
					id: 'p.3.1.1',
					name: 'Короткое замыкание с фазой C',
					active: false,
				},
				{
					id: 'p.3.1.2',
					name: 'Короткое замыкание с фазой B',
					active: false,
				},
				{
					id: 'p.3.1.3',
					name: 'Обрыв',
					active: false,
				},
				{
					id: 'p.3.1.4',
					name: 'Короткое замыкание на землю',
					active: false,
				},
			],
		},
		[
			[
				{
					id: 'p.4.1.1',
					name: 'Контакты пускателя открыть фаза A',
					resistance: 1000000000,

					malfunctions: [
						{
							id: 'p.4.1.1.1',
							name: 'Неисправна катушка, пускатель не подтягивается',
							active: false,
						},
						{
							id: 'p.4.1.1.2',
							name: 'Нет контакта в контактной группе',
							active: false,
						},
						{
							id: 'p.4.1.1.3',
							name: 'Залипший контакт в контактной группе',
							active: false,
						},
					],
				},
				{
					id: 'p.5.1',
					name: 'Фаза A от пускателя до двигателя',
					resistance: 0.1,

					malfunctions: [
						{
							id: 'p.5.1.1',
							name: 'Короткое замыкание с фазой C',
							active: false,
						},
						{
							id: 'p.5.1.2',
							name: 'Короткое замыкание с фазой B',
							active: false,
						},
						{
							id: 'p.5.1.3',
							name: 'Обрыв',
							active: false,
						},
						{
							id: 'p.5.1.4',
							name: 'Короткое замыкание на землю',
							active: false,
						},
					],
				},
				{
					id: 'p.6.1',
					name: 'Электродвигатель задвижки, обмотка фазы А',
					resistance: 4.1,

					malfunctions: [
						{
							id: 'p.6.1.1',
							name: 'Обрыв фазы',
							active: false,
						},
						{
							id: 'p.6.1.2',
							name: 'Короткое замыкание между фазами',
							active: false,
						},
						{
							id: 'p.6.1.3',
							name: 'Короткое замыкание обмотки на землю',
							active: false,
						},
					],
				},
			],
			[
				{
					id: 'p.4.2.3',
					name: 'Контакты пускателя закрыть фаза С',
					resistance: 1000000000,

					malfunctions: [
						{
							id: 'p.4.1.3.1',
							name: 'Неисправна катушка, пускатель не подтягивается',
							active: false,
						},
						{
							id: 'p.4.1.3.2',
							name: 'Нет контакта в контактной группе',
							active: false,
						},
						{
							id: 'p.4.1.3.3',
							name: 'Залипший контакт в контактной группе',
							active: false,
						},
					],
				},
				{
					id: 'p.5.2',
					name: 'Фаза С от пускателя до двигателя',
					resistance: 0.1,

					malfunctions: [
						{
							id: 'p.5.2.1',
							name: 'Короткое замыкание с фазой C',
							active: false,
						},
						{
							id: 'p.5.2.2',
							name: 'Короткое замыкание с фазой B',
							active: false,
						},
						{
							id: 'p.5.2.3',
							name: 'Обрыв',
							active: false,
						},
						{
							id: 'p.5.2.4',
							name: 'Короткое замыкание на землю',
							active: false,
						},
					],
				},
				{
					id: 'p.6.2',
					name: 'Электродвигатель задвижки, обмотка фазы С',
					resistance: 4.1,

					malfunctions: [
						{
							id: 'p.6.2.1',
							name: 'Обрыв фазы',
							active: false,
						},
						{
							id: 'p.6.2.2',
							name: 'Короткое замыкание между фазами',
							active: false,
						},
						{
							id: 'p.6.2.3',
							name: 'Короткое замыкание обмотки на землю',
							active: false,
						},
					],
				},
			],
		],
	],
	[
		{
			id: 'p.1.2',
			name: 'Провод от фазы В до автомата',
			resistance: 0.1,

			malfunctions: [
				{
					id: 'p.1.2.1',
					name: 'Короткое замыкание с фазой A',
					active: false,
				},
				{
					id: 'p.1.2.2',
					name: 'Короткое замыкание с фазой C',
					active: false,
				},
				{ id: 'p.1.2.3', name: 'Обрыв', active: false },
				{
					id: 'p.1.2.4',
					name: 'Короткое замыкание на землю',
					active: false,
				},
				{
					id: 'p.1.2.5',
					name: 'Обрыв провода',
					active: false,
				},
			],
		},
		{
			id: 'p.2.2',
			name: 'Сухой контакт  фазы С автомата',
			resistance: 0,

			malfunctions: [
				{
					id: 'p.2.2.1',
					name: 'Плохой контакт на клемме',
					active: false,
				},
				{
					id: 'p.2.2.2',
					name: 'Ложное срабатывание',
					active: false,
				},
				{
					id: 'p.2.2.3',
					name: 'Нет коммутации',
					active: false,
				},
			],
		},
		{
			id: 'p.3.2',
			name: 'Провод фазы B от автомата до пускателей',
			resistance: 0.1,

			malfunctions: [
				{
					id: 'p.3.2.1',
					name: 'Короткое замыкание с фазой A',
					active: false,
				},
				{
					id: 'p.3.2.2',
					name: 'Короткое замыкание с фазой C',
					active: false,
				},
				{ id: 'p.3.2.3', name: 'Обрыв', active: false },
				{
					id: 'p.3.2.4',
					name: 'Короткое замыкание на землю',
					active: false,
				},
			],
		},
		[
			{
				id: 'p.4.2.1',
				name: 'Контакты пускателя открыть фаза В',
				resistance: 1000000000,

				malfunctions: [
					{
						id: 'p.4.2.1.1',
						name: 'Неисправна катушка, пускатель не подтягивается',
						active: false,
					},
					{
						id: 'p.4.2.1.2',
						name: 'Нет контакта в контактной группе',
						active: false,
					},
					{
						id: 'p.4.2.1.3',
						name: 'Залипший контакт в контактной группе',
						active: false,
					},
				],
			},
			{
				id: 'p.4.2.2',
				name: 'Контакты пускателя закрыть фаза В',
				resistance: 1000000000,

				malfunctions: [
					{
						id: 'p.4.2.2.1',
						name: 'Неисправна катушка, пускатель не подтягивается',
						active: false,
					},
					{
						id: 'p.4.2.2.2',
						name: 'Нет контакта в контактной группе',
						active: false,
					},
					{
						id: 'p.4.2.2.3',
						name: 'Залипший контакт в контактной группе',
						active: false,
					},
				],
			},
		],
		{
			id: 'p.5.2',
			name: 'Фаза В от пускателя до двигателя',
			resistance: 0.1,

			malfunctions: [
				{
					id: 'p.5.1.1',
					name: 'Короткое замыкание с фазой А',
					active: false,
				},
				{
					id: 'p.5.1.2',
					name: 'Короткое замыкание с фазой B',
					active: false,
				},
				{
					id: 'p.5.1.3',
					name: 'Обрыв',
					active: false,
				},
				{
					id: 'p.5.1.4',
					name: 'Короткое замыкание на землю',
					active: false,
				},
			],
		},
		{
			id: 'p.6.2',
			name: 'Электродвигатель задвижки, обмотка фазы В',
			resistance: 4.1,

			malfunctions: [
				{
					id: 'p.6.2.1',
					name: 'Обрыв фазы',
					active: false,
				},
				{
					id: 'p.6.2.2',
					name: 'Короткое замыкание между фазами',
					active: false,
				},
				{
					id: 'p.6.2.3',
					name: 'Короткое замыкание обмотки на землю',
					active: false,
				},
			],
		},
	],
	[
		{
			id: 'p.1.3',
			name: 'Провод от фазы С до автомата',
			resistance: 0.1,

			malfunctions: [
				{
					id: 'p.1.3.1',
					name: 'Короткое замыкание с фазой A',
					active: false,
				},
				{
					id: 'p.1.3.2',
					name: 'Короткое замыкание с фазой B',
					active: false,
				},
				{
					id: 'p.1.3.3',
					name: 'Обрыв',
					active: false,
				},
				{
					id: 'p.1.3.4',
					name: 'Короткое замыкание на землю',
					active: false,
				},
				{
					id: 'p.1.3.5',
					name: 'Обрыв провода',
					active: false,
				},
			],
		},
		{
			id: 'p.2.3',
			name: 'Сухой контакт  фазы С автомата',
			resistance: 0,

			malfunctions: [
				{
					id: 'p.2.3.1',
					name: 'Плохой контакт на клемме, нет фазы',
					active: false,
				},
				{
					id: 'p.2.3.2',
					name: 'Ложно выбивает',
					active: false,
				},
				{
					id: 'p.2.3.3',
					name: 'Механическая сборка есть, но нет коммутации',
					active: false,
				},
			],
		},
		{
			id: 'p.3.3',
			name: 'Провод фазы C от автомата до пускателей',
			resistance: 0.1,

			malfunctions: [
				{
					id: 'p.3.3.1',
					name: 'Короткое замыкание с фазой A',
					active: false,
				},
				{
					id: 'p.3.3.2',
					name: 'Короткое замыкание с фазой B',
					active: false,
				},
				{
					id: 'p.3.3.3',
					name: 'Обрыв',
					active: false,
				},
				{
					id: 'p.3.3.4',
					name: 'Короткое замыкание на землю',
					active: false,
				},
			],
		},
		[
			[
				{
					id: 'p.4.3.1',
					name: 'Контакты пускателя открыть фаза С',
					resistance: 1000000000,

					malfunctions: [
						{
							id: 'p.4.3.1.1',
							name: 'Неисправна катушка, пускатель не срабатывает',
							active: false,
						},
						{
							id: 'p.4.3.1.2',
							name: 'Нет контакта в группе',
							active: false,
						},
						{
							id: 'p.4.3.1.3',
							name: 'Залипание контактов',
							active: false,
						},
					],
				},
				{
					id: 'p.5.3',
					name: 'Фаза С от пускателя до двигателя',
					resistance: 0.1,

					malfunctions: [
						{
							id: 'p.5.3.1',
							name: 'Короткое замыкание с фазой A',
							active: false,
						},
						{
							id: 'p.5.3.2',
							name: 'Короткое замыкание с фазой B',
							active: false,
						},
						{
							id: 'p.5.3.3',
							name: 'Обрыв',
							active: false,
						},
						{
							id: 'p.5.3.4',
							name: 'Короткое замыкание на землю',
							active: false,
						},
					],
				},
				{
					id: 'p.6.3',
					name: 'Электродвигатель задвижки, обмотка фазы C',
					resistance: 4.1,

					malfunctions: [
						{
							id: 'p.6.3.1',
							name: 'Обрыв фазы',
							active: false,
						},
						{
							id: 'p.6.3.2',
							name: 'Короткое замыкание между фазами',
							active: false,
						},
						{
							id: 'p.6.3.3',
							name: 'Короткое замыкание обмотки на корпус',
							active: false,
						},
					],
				},
			],
			[
				{
					id: 'p.4.1.1',
					name: 'Контакты пускателя закрыть фаза A ',
					resistance: 1000000000,

					malfunctions: [
						{
							id: 'p.4.1.1.1',
							name: 'Неисправна катушка, пускатель не подтягивается',
							active: false,
						},
						{
							id: 'p.4.1.1.2',
							name: 'Нет контакта в контактной группе',
							active: false,
						},
						{
							id: 'p.4.1.1.3',
							name: 'Залипший контакт в контактной группе',
							active: false,
						},
					],
				},
				{
					id: 'p.5.1',
					name: 'Фаза A от пускателя до двигателя',
					resistance: 0.1,

					malfunctions: [
						{
							id: 'p.5.1.1',
							name: 'Короткое замыкание с фазой C',
							active: false,
						},
						{
							id: 'p.5.1.2',
							name: 'Короткое замыкание с фазой B',
							active: false,
						},
						{
							id: 'p.5.1.3',
							name: 'Обрыв',
							active: false,
						},
						{
							id: 'p.5.1.4',
							name: 'Короткое замыкание на землю',
							active: false,
						},
					],
				},
				{
					id: 'p.6.1',
					name: 'Электродвигатель задвижки, обмотка фазы А',
					resistance: 4.1,

					malfunctions: [
						{
							id: 'p.6.1.1',
							name: 'Обрыв фазы',
							active: false,
						},
						{
							id: 'p.6.1.2',
							name: 'Короткое замыкание между фазами',
							active: false,
						},
						{
							id: 'p.6.1.3',
							name: 'Короткое замыкание обмотки на землю',
							active: false,
						},
					],
				},
			],
		],
	],
];
const controlCircuit = [
	{
		id: 'c.1',
		name: 'Автомат питания цепей управления',
		resistance: 0,

		malfunctions: [
			{
				id: 'c.1.1',
				name: 'Плохой контакт на клемме, нет фазы',
				active: false,
			},
			{
				id: 'c.1.2',
				name: 'Ложно выбивает',
				active: false,
			},
			{
				id: 'c.1.3',
				name: 'Собирается механически, но нет коммутации',
				active: false,
			},
		],
	},
	{
		id: 'c.2',
		name: 'Провод фазы после автомата',
		resistance: 0.1,

		malfunctions: [
			{
				id: 'c.2.1',
				name: 'Обрыв провода',
				active: false,
			},
			{
				id: 'c.2.2',
				name: 'Короткое замыкание на землю',
				active: false,
			},
			{
				id: 'c.2.3',
				name: 'Короткое замыкание с проводом от фазы на концевой выключатель закрыто',
				active: false,
			},
			{
				id: 'c.2.4',
				name: 'Короткое замыкание с проводом фазы двигателя',
				active: false,
			},
		],
	},
	[
		[
			//ветка открыть
			{
				id: 'c.3.1.1',
				name: 'Концевой выключатель открыто',
				resistance: 0,

				malfunctions: [
					{
						id: 'c.3.1.1.1',
						name: 'Залипший контакт',
						active: false,
					},
					{
						id: 'c.3.1.1.2',
						name: 'Нет контакта',
						active: false,
					},
					{
						id: 'c.3.1.1.3',
						name: 'Не настроен',
						active: false,
					},
				],
			},
			{
				id: 'c.3.1.2',
				name: 'Провод концевого выключателя открыто до клемника КРУЗА-П',
				resistance: 0.1,

				malfunctions: [
					{
						id: 'c.3.1.2.1',
						name: 'Обрыв провода',
						active: false,
					},
					{
						id: 'c.3.1.2.2',
						name: 'Короткое замыкание на землю',
						active: false,
					},
					{
						id: 'c.3.1.2.3',
						name: 'Короткое замыкание с проводом концевого выключателя закрыто до клемника КРУЗА-П',
						active: false,
					},
					{
						id: 'c.3.1.2.4',
						name: 'Короткое замыкание с проводом фазы двигателя',
						active: false,
					},
				],
			},
			[
				{
					id: 'c.3.1.3.1',
					name: 'Вставка NDI (сигнал «не открыто»)',
					resistance: 0,

					malfunctions: [
						{
							id: 'c.3.1.3.1.1',
							name: 'Нет контакта, сигнал не проходит',
							active: false,
						},
						{
							id: 'c.3.1.3.1.2',
							name: 'Ложно сработанная, сигнал не снимается',
							active: false,
						},
					],
				},
				[
					[
						{
							id: 'c.3.1.3.2.1.1',
							name: 'Вставка NDO (команда открыть с ПТК)',
							resistance: 1000000000,

							malfunctions: [
								{
									id: 'c.3.1.3.2.1.1.1',
									name: 'Нет контакта, команда не уходит',
									active: false,
								},
								{
									id: 'c.3.1.3.2.1.1.2',
									name: 'Ложно сработанная, команда постоянно висит',
									active: false,
								},
							],
						},
						{
							id: 'c.3.1.3.2.1.2',
							name: 'Кнопка КРУЗА-П (команда открыть с КРУЗА-П)',
							resistance: 1000000000,

							malfunctions: [
								{
									id: 'c.3.1.3.2.1.2.1',
									name: 'Нет контакта, команда не уходит',
									active: false,
								},
								{
									id: 'c.3.1.3.2.1.2.2',
									name: 'Ложно сработанная, команда постоянно висит',
									active: false,
								},
							],
						},
					],
					{
						id: 'c.3.1.3.2.2',
						name: 'Блокировка включения пускателя на открыте',
						resistance: 0,

						malfunctions: [
							{
								id: 'c.3.1.3.2.2.1',
								name: 'Нет контакта',
								active: false,
							},
							{
								id: 'c.3.1.3.2.2.2',
								name: 'Ложно сработанный контакт',
								active: false,
							},
						],
					},
					{
						id: 'c.3.1.3.2.3',
						name: 'Катушка пускателя открыть',
						resistance: 6400,

						malfunctions: [
							{
								id: 'c.3.1.3.2.3.1',
								name: 'Неисправна катушка, пускатель не подтягивается',
								active: false,
							},
						],
					},
				],
				{
					id: 'c.3.1.3.3',
					name: 'Лампа в КРУЗА-П закрыто',
					resistance: 4800,

					malfunctions: [
						{
							id: 'c.3.1.3.3.1',
							name: 'Перегорела',
							active: false,
						},
					],
				},
			],
		],
		[
			//ветка закрыть
			{
				id: 'c.3.2.1',
				name: 'Концевой выключатель закрыто',
				resistance: 0,

				malfunctions: [
					{
						id: 'c.3.2.1.1',
						name: 'Залипший контакт',
						active: false,
					},
					{
						id: 'c.3.2.1.2',
						name: 'Нет контакта',
						active: false,
					},
					{
						id: 'c.3.2.1.3',
						name: 'Не настроен',
						active: false,
					},
				],
			},
			{
				id: 'c.3.2.2',
				name: 'Провод концевого выключателя закрыто до клемника КРУЗА-П',
				resistance: 0.1,

				malfunctions: [
					{
						id: 'c.3.2.2.1',
						name: 'Обрыв провода',
						active: false,
					},
					{
						id: 'c.3.2.2.2',
						name: 'Короткое замыкание на землю',
						active: false,
					},
					{
						id: 'c.3.2.2.3',
						name: 'Короткое замыкание с проводом концевого выключателя закрыто до клемника КРУЗА-П',
						active: false,
					},
					{
						id: 'c.3.2.2.4',
						name: 'Короткое замыкание с проводом фазы двигателя',
						active: false,
					},
				],
			},
			[
				{
					id: 'c.3.2.3.1',
					name: 'Вставка NDI (сигнал «не закрыто»)',
					resistance: 0,

					malfunctions: [
						{
							id: 'c.3.2.3.1.1',
							name: 'Нет контакта, сигнал не проходит',
							active: false,
						},
						{
							id: 'c.3.2.3.1.2',
							name: 'Ложно сработанная, сигнал не снимается',
							active: false,
						},
					],
				},
				[
					[
						{
							id: 'c.3.2.3.2.1.1',
							name: 'Вставка NDO (команда закрыть с ПТК)',
							resistance: 1000000000,

							malfunctions: [
								{
									id: 'c.3.2.3.2.1.1.1',
									name: 'Нет контакта, команда не уходит',
									active: false,
								},
								{
									id: 'c.3.2.3.2.1.1.2',
									name: 'Ложно сработанная, команда постоянно висит',
									active: false,
								},
							],
						},
						{
							id: 'c.3.2.3.2.1.2',
							name: 'Кнопка КРУЗА-П (команда закрыть с КРУЗА-П)',
							resistance: 1000000000,

							malfunctions: [
								{
									id: 'c.3.2.3.2.1.2.1',
									name: 'Нет контакта, команда не уходит',
									active: false,
								},
								{
									id: 'c.3.2.3.2.1.2.2',
									name: 'Ложно сработанная, команда постоянно висит',
									active: false,
								},
							],
						},
					],

					{
						id: 'c.3.2.3.2.2',
						name: 'Блокировка включения пускателя на закрыть',
						resistance: 0,

						malfunctions: [
							{
								id: 'c.3.2.3.2.2.1',
								name: 'Нет контакта',
								active: false,
							},
							{
								id: 'c.3.2.3.2.2.2',
								name: 'Ложно сработанный контакт',
								active: false,
							},
						],
					},
					{
						id: 'c.3.2.3.2.3',
						name: 'Катушка пускателя закрыть',
						resistance: 6400,

						malfunctions: [
							{
								id: 'c.3.2.3.2.3.1',
								name: 'Неисправна катушка, пускатель не подтягивается',
								active: false,
							},
						],
					},
				],
				{
					id: 'c.3.2.3.3',
					name: 'Лампа в КРУЗА-П открыто',
					resistance: 4800,

					malfunctions: [
						{
							id: 'c.3.2.3.3.1',
							name: 'Перегорела',
							active: false,
						},
					],
				},
			],
		],
	],
];
export const initialState: InitialState = {
	powerCircuit: powerCircuit,
	controlCircuit: controlCircuit,
};

const powerCircuitJson = `[
	[
	  {
		"id": "p.1.1",
		"name": "Провод от фазы А до автомата",
		"malfunctions": [
		  { "id": "p.1.1.1", "name": "Короткое замыкание с фазой C", "active": false },
		  { "id": "p.1.1.2", "name": "Короткое замыкание с фазой B", "active": false },
		  { "id": "p.1.1.3", "name": "Обрыв", "active": false },
		  { "id": "p.1.1.4", "name": "Короткое замыкание на землю", "active": false },
		  { "id": "p.1.1.5", "name": "Обрыв провода", "active": false }
		]
	  },
	  {
		"id": "p.2.1",
		"name": "Сухой контакт фазы А автомата",
		"malfunctions": [
		  { "id": "p.2.1", "name": "Плохой контакт на клемме, нет одной фазы", "active": false },
		  { "id": "p.2.2", "name": "Ложно выбивает", "active": false },
		  { "id": "p.2.3", "name": "Собирается механически, но нет коммутации", "active": false }
		]
	  },
	  {
		"id": "p.3.1",
		"name": "Провод фазы A от автомата до пускателей",
		"malfunctions": [
		  { "id": "p.3.1.1", "name": "Короткое замыкание с фазой C", "active": false },
		  { "id": "p.3.1.2", "name": "Короткое замыкание с фазой B", "active": false },
		  { "id": "p.3.1.3", "name": "Обрыв", "active": false },
		  { "id": "p.3.1.4", "name": "Короткое замыкание на землю", "active": false }
		]
	  },
	  [
		[
		  {
			"id": "p.4.1.1",
			"name": "Контакты пускателя открыть фаза A",
			"malfunctions": [
			  { "id": "p.4.1.1.1", "name": "Неисправна катушка, пускатель не подтягивается", "active": false },
			  { "id": "p.4.1.1.2", "name": "Нет контакта в контактной группе", "active": false },
			  { "id": "p.4.1.1.3", "name": "Залипший контакт в контактной группе", "active": false }
			]
		  },
		  {
			"id": "p.5.1",
			"name": "Фаза A от пускателя до двигателя",
			"malfunctions": [
			  { "id": "p.5.1.1", "name": "Короткое замыкание с фазой C", "active": false },
			  { "id": "p.5.1.2", "name": "Короткое замыкание с фазой B", "active": false },
			  { "id": "p.5.1.3", "name": "Обрыв", "active": false },
			  { "id": "p.5.1.4", "name": "Короткое замыкание на землю", "active": false }
			]
		  },
		  {
			"id": "p.6.1",
			"name": "Электродвигатель задвижки, обмотка фазы А",
			"malfunctions": [
			  { "id": "p.6.1.1", "name": "Обрыв фазы", "active": false },
			  { "id": "p.6.1.2", "name": "Короткое замыкание между фазами", "active": false },
			  { "id": "p.6.1.3", "name": "Короткое замыкание обмотки на землю", "active": false }
			]
		  }
		],
		[
		  {
			"id": "p.4.2.3",
			"name": "Контакты пускателя закрыть фаза С",
			"malfunctions": [
			  { "id": "p.4.1.3.1", "name": "Неисправна катушка, пускатель не подтягивается", "active": false },
			  { "id": "p.4.1.3.2", "name": "Нет контакта в контактной группе", "active": false },
			  { "id": "p.4.1.3.3", "name": "Залипший контакт в контактной группе", "active": false }
			]
		  },
		  {
			"id": "p.5.2",
			"name": "Фаза С от пускателя до двигателя",
			"malfunctions": [
			  { "id": "p.5.2.1", "name": "Короткое замыкание с фазой C", "active": false },
			  { "id": "p.5.2.2", "name": "Короткое замыкание с фазой B", "active": false },
			  { "id": "p.5.2.3", "name": "Обрыв", "active": false },
			  { "id": "p.5.2.4", "name": "Короткое замыкание на землю", "active": false }
			]
		  },
		  {
			"id": "p.6.2",
			"name": "Электродвигатель задвижки, обмотка фазы С",
			"malfunctions": [
			  { "id": "p.6.2.1", "name": "Обрыв фазы", "active": false },
			  { "id": "p.6.2.2", "name": "Короткое замыкание между фазами", "active": false },
			  { "id": "p.6.2.3", "name": "Короткое замыкание обмотки на землю", "active": false }
			]
		  }
		]
	  ]
	]
  ]
  `;

const powerCircuitId = [
	[
		{
			id: 'p.1.1',
			name: 'Провод от фазы А до автомата',
			resistance: 0.1,
		},
		{
			id: 'p.1.2',
			name: 'Сухой контакт фазы А автомата',
			resistance: 0,
		},
		{
			id: 'p.1.3',
			name: 'Провод фазы A от автомата до пускателей',
			resistance: 0.1,
		},
		[
			[
				{
					id: 'p.1.4.1.1',
					name: 'Контакты пускателя открыть фаза A',
					resistance: 1000000000,
				},
				{
					id: 'p.1.4.1.2',
					name: 'Фаза A от пускателя до двигателя',
					resistance: 0.1,
				},
				{
					id: 'p.1.4.1.3',
					name: 'Электродвигатель задвижки, обмотка фазы А',
					resistance: 4.1,
				},
			],
			[
				{
					id: 'p.1.4.2.1',
					name: 'Контакты пускателя закрыть фаза С',
					resistance: 1000000000,
				},
				{
					id: 'p.1.4.2.2',
					name: 'Фаза С от пускателя до двигателя',
					resistance: 0.1,
				},
				{
					id: 'p.1.4.2.3',
					name: 'Электродвигатель задвижки, обмотка фазы С',
					resistance: 4.1,
				},
			],
		],
	],
	[
		{
			id: 'p.2.1',
			name: 'Провод от фазы В до автомата',
			resistance: 0.1,
		},
		{
			id: 'p.2.2',
			name: 'Сухой контакт  фазы С автомата',
			resistance: 0,
		},
		{
			id: 'p.2.3',
			name: 'Провод фазы B от автомата до пускателей',
			resistance: 0.1,
		},
		[
			{
				id: 'p.2.4.1',
				name: 'Контакты пускателя открыть фаза В',
				resistance: 1000000000,
			},
			{
				id: 'p.2.4.2',
				name: 'Контакты пускателя закрыть фаза В',
				resistance: 1000000000,
			},
		],
		{
			id: 'p.2.5',
			name: 'Фаза В от пускателя до двигателя',
			resistance: 0.1,
		},
		{
			id: 'p.2.6',
			name: 'Электродвигатель задвижки, обмотка фазы В',
			resistance: 4.1,
		},
	],
	[
		{
			id: 'p.3.1',
			name: 'Провод от фазы С до автомата',
			resistance: 0.1,
		},
		{
			id: 'p.3.2',
			name: 'Сухой контакт  фазы С автомата',
			resistance: 0,
		},
		{
			id: 'p.3.3',
			name: 'Провод фазы C от автомата до пускателей',
			resistance: 0.1,
		},
		[
			[
				{
					id: 'p.3.4.1.1',
					name: 'Контакты пускателя открыть фаза С',
					resistance: 1000000000,
				},
				{
					id: 'p.3.4.1.2',
					name: 'Фаза С от пускателя до двигателя',
					resistance: 0.1,
				},
				{
					id: 'p.3.4.1.3',
					name: 'Электродвигатель задвижки, обмотка фазы C',
					resistance: 4.1,
				},
			],
			[
				{
					id: 'p.3.4.2.1',
					name: 'Контакты пускателя закрыть фаза A ',
					resistance: 1000000000,
				},
				{
					id: 'p.3.4.2.2',
					name: 'Фаза A от пускателя до двигателя',
					resistance: 0.1,
				},
				{
					id: 'p.3.4.2.3',
					name: 'Электродвигатель задвижки, обмотка фазы А',
					resistance: 4.1,
				},
			],
		],
	],
];
